stress.backend.yml
config:
  target: "http://34.71.183.37:3000"
  phases:
    - duration: 1
      arrivalRate: 5000
  payload:
    path: "permisos.csv"
    fields:
      - "rut"
      - "region"
      - "comuna"
      - "direccion"
      - "ventana"
scenarios:
  - flow:
    - post:
        url: "/api/permisos"
        json:
          id_persona: "{{ rut }}"
          region: "{{ region }}"
          comuna: "{{ comuna }}"
          direccion: "{{ direccion }}"
          ventana: "{{ ventana }}"